In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.702287  0.024769
1    a  two -1.599800 -1.118803
2    b  one -0.421189  0.959754
3    b  two  0.141742 -0.705502
4    a  one -0.780139  1.265683

In [3]:
df.groupby(by=['key1','key2']).sum()

              data1     data2
key1 key2
a    one  -0.077852  1.290452
     two  -1.599800 -1.118803
b    one  -0.421189  0.959754
     two   0.141742 -0.705502

In [5]:
df[['key1','data1','data2']].groupby(by='key1').sum()

         data1     data2
key1
a    -1.677652  0.171649
b    -0.279446  0.254252

In [6]:
df[['key2','data1','data2']].groupby(by='key2').sum()

         data1     data2
key2
one  -0.499041  2.250206
two  -1.458058 -1.824306

In [7]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.932433  0.833057
1    a  two -1.652147 -0.526444
2    b  one -0.317045  0.865188
3    b  two -0.471007 -0.126507
4    a  one  1.618762  1.840818

In [14]:
#將groupby物件,選取需要統計的欄位
df.groupby(['key1','key2'])[['data1']].sum()

              data1
key1 key2
a    one   3.551195
     two  -1.652147
b    one  -0.317045
     two  -0.471007

In [15]:
import pandas as pd
df1 = pd.read_csv('每日各站進出站人數2022.csv')
df1.columns = ['日期','code','進站','出站']
df1['日期'] = pd.to_datetime(df1['日期'].astype(str))
df1['月份'] = df1['日期'].dt.month
df1

              日期  code    進站    出站  月份
0     2022-01-01   900  8645  8526   1
1     2022-01-01   910   996  1243   1
2     2022-01-01   920  1369  1711   1
3     2022-01-01   930  3663  4535   1
4     2022-01-01   940  1532  1845   1
...          ...   ...   ...   ...  ..
86547 2022-12-31  7360  3984  3893  12
86548 2022-12-31  7361    92   115  12
86549 2022-12-31  7362   131   159  12
86550 2022-12-31  7380   494   426  12
86551 2022-12-31  7390   313   274  12

[86552 rows x 5 columns]

In [17]:
df1.groupby(by=['code','月份'])[['出站','進站']].sum()

             出站      進站
code 月份
900  1   177861  188317
     2   161807  170885
     3   201651  213987
     4   136851  144263
     5   107821  114120
...         ...     ...
7390 8    12918   12175
     9    12545   12331
     10   12705   12421
     11   14623   14489
     12   14202   13961

[2867 rows x 2 columns]

In [18]:
df1.groupby(by=['code'])[['出站','進站']].sum()

           出站       進站
code
900   2129512  2253504
910    422225   411286
920    646678   694663
930   1776557  1764417
940    753939   753424
...       ...      ...
7360  1120786  1095349
7361    22368    17106
7362    45962    37982
7380   205081   209800
7390   146951   140997

[239 rows x 2 columns]

In [19]:
df1.groupby(by=['月份'])[['出站','進站']].sum()

          出站        進站
月份
1   14331609  14331609
2   13090244  13090244
3   16465704  16465704
4   13741557  13741557
5    9699057   9699057
6   10838883  10838883
7   14225428  14225428
8   15660748  15660748
9   15458656  15458656
10  16528375  16528375
11  17161542  17161542
12  18157820  18157820